cask_args appdir: "/Applications"

# taps
tap 'homebrew/cask-cask'
tap 'crisidev/homebrew-chunkwm'
tap 'microsoft/mssql-release', "https://github.com/Microsoft/homebrew-mssql-release"

# plug-ins
brew 'mas'

# brew apps
brew 'ag'
brew 'autojump'
brew 'awscli'
brew 'bat'
brew 'chunkwm'
brew 'diff-so-fancy'
brew 'docker'
brew 'exa'
brew 'freetds'
brew 'git'
brew 'gpg'
brew 'heroku'
brew 'hub'
brew 'jq'
brew 'neovim'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'readline'
brew 'wget'
#brew install koekeishiya/formulae/skhd
brew 'mssql-tools'

# casks
#cask 'atom'
cask 'firefox'
cask 'java'
#cask 'kitty'
cask 'codeship/taps/jet'

# app store apps
mas 'ssh-tunnel',      id: 734418810
mas 'monosnap',        id: 540348655
#smas 'evernote',        id: 406056744
mas 'lastpass',        id: 926036361

# other
# minpac - package manager for nvim
# git clone https://github.com/k-takata/minpac.git ~/.config/nvim/pack/minpac/opt/minpac
# 
# FileZilla
# Postman
# Aqua Data Studio
# Google Drive
# Cord
# Tableau
# Typora
# yEd

