cask_args appdir: "/Applications"

# taps
tap 'caskroom/cask'
tap 'crisidev/homebrew-chunkwm'

# plug-ins
brew 'mas'

# brew apps
brew 'ag'
brew 'awscli'
brew 'chunkwm'
brew 'docker'
brew 'exa'
brew 'git'
brew 'heroku'
brew 'hub'
brew 'neovim'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'wget'
#brew install koekeishiya/formulae/skhd

# casks
cask 'atom'
#cask 'kitty'

# app store apps
mas 'ssh-tunnel',      id: 734418810
mas 'monosnap',        id: 540348655
mas 'evernote',        id: 406056744
mas 'lastpass',        id: 926036361

# other
# minpac - package manager for nvim
# git clone https://github.com/k-takata/minpac.git ~/.config/nvim/pack/minpac/opt/minpac
# 
# FileZilla
# Postman
# Aqua Data Studio
# Google Drive
# Cord
# Tableau
# Typora
# yEd

